/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "تعذر إكمال العملية";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "حدث خطأ غير معروف (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "لا يمكن إكمال الإجراء";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "حاول مرة أخرى في وقت لاحق.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "لا يمكن التسجيل";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "لا يمكن التسجيل";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "قم بإيقاف أية إجراءات تستخدم %@ ثم حاول مرة أخرى."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "لا يمكن التسجيل";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "ليست هناك مساحة كافية لمواصلة كتابة الملف. قم بتوفير مساحة وذلك بحذف الفيديوهات أو الصور الموجودة.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "وصل التسجيل إلى الحد الأقصى المسموح به لمدى الملف."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "وصل التسجيل إلى الحد الأقصى المسموح به لحجم الملف."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "قم بإيقاف أية إجراءات تستخدم جهاز التسجيل ثم حاول مرة أخرى.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "وصل التسجيل إلى الحد الأقصى المسموح به لمدى الملف."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "لا يمكن التسجيل";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "حاول التسجيل مرة أخرى.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "لا يمكن استخدام %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "قم بإيقاف أية إجراءات تستخدم %@ ثم حاول مرة أخرى."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "لا يمكن استخدام %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "قم بإيقاف أية إجراءات تستخدم %@ ثم حاول مرة أخرى."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "تم إيقاف التسجيل";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "قم بإيقاف أية إجراءات تستخدم جهاز التسجيل ثم حاول مرة أخرى.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "لا يمكن تشغيل الشعلة.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "حاول تشغيل الشعلة على مستوى أقل.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "لا يمكن إكمال الإجراء";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "حاول مرة أخرى في وقت لاحق.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "لا يمكن إكمال التصدير";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "حاول التصدير مرة أخرى.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "لا يمكن فك الترميز";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "تعذر فك ترميز بيانات الوسائط. قد تكون تالفة.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "تنسيق الوسائط غير مدعوم.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "لا يمكن الحفظ";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "حاول الحفظ مرة أخرى.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "لا يمكن كتابة ملف خارج";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "قم بتغيير الملحق الخارج ثم حاول مرة أخرى.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "لا يمكن استخدام هذه الوسائط.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "تنسيق الوسائط غير مدعوم.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "ربما تكون هذه الوسائط تالفة.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "لا يمكن أخذ صورة";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "حاول أخذ الصورة مرة أخرى.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "هذه العملية غير مدعومة للمحتوى المحمي."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "هذا المحتوى غير مخوَّل."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "هذا التطبيق غير مخول بتشغيل هذا الملف."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "لا يمكن فك الترميز";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "لا يمكن العثور على وحدة فك الترميز لهذه الوسائط.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "لا يمكن الترميز";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "لا يمكن العثور على وحدة الترميز لهذه الوسائط.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "لا يمكن فك الترميز";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "وحدة فك الترميز لهذه الوسائط مشغولة.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "قم بإيقاف أية إجراءات تقوم بفك ترميز الوسائط ثم حاول مرة أخرى.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "لا يمكن الترميز";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "وحدة الترميز لهذه الوسائط مشغولة.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "قم بإيقاف أية إجراءات تقوم بترميز الوسائط ثم حاول مرة أخرى.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "لا يمكن استخدام %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "قد لا يتم استخدام %@من قِبل تطبيق يعمل في الخلفية."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "العملية غير مدعومة لهذه الوسائط.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "تعذر إنشاء الفيديو حسب التعليمات الموفرة.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "لا يمكن استخدام هذه الوسائط.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "لا يمكن استخدام ملف الذاكرة المؤقتة عند تنزيل وجهة الـ URL.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "يحتوي الملف على مجموع اختباري غير صالح.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "تمت مقاطعة العملية";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "قم بوقف العمليات الأخرى ثم حاول مرة أخرى.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "لا يمكن فتح";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "لا يمكن استخدام هذه الوسائط على هذا الجهاز.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "ربما تكون هذه الوسائط تالفة.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "توقفت العملية";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "لم يتم إعداد الخادم بطريقة صحيحة.";
